{
  "backend/main.mo": "Main Motoko actor implementing user profile and Amazon product listing management with Internet Identity-based access control. Exposes CRUD operations for profiles and products, with public read access and authenticated write access.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (profile page, product showcase, authentication, visual theme) to their corresponding source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing the purpose of hooks, components, styles, and the root App component.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, card, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point titled 'Amazon Product Advertiser Profile' that mounts the React app via a root div and loads the main TSX module.",
  "frontend/src/App.tsx": "Root React component that composes Header, ProfileHero, ProductGrid, ProfileSetupModal, and a footer, wiring authentication state to conditional rendering and owner-only edit controls.",
  "frontend/src/components/AddProductModal.tsx": "Dialog modal with a form for adding a new Amazon product listing, requiring title and Amazon URL, with optional description, price, and thumbnail URL fields.",
  "frontend/src/components/EditProductModal.tsx": "A dialog modal that allows the owner to edit an existing product listing's title, description, price, thumbnail URL, and Amazon URL, submitting changes via the useUpdateProduct mutation hook.",
  "frontend/src/components/EditProfileModal.tsx": "A dialog modal that lets the authenticated user edit their public profile fields (display name, bio, social handle, profile photo URL) and saves changes via the useSaveCallerUserProfile mutation hook.",
  "frontend/src/components/Header.tsx": "A sticky top navigation header displaying the app logo and an auth button that toggles between Login and Logout based on authentication state from useAuth.",
  "frontend/src/components/ProductCard.tsx": "Renders a single product listing card with thumbnail, price badge, title, description, and an Amazon link button, plus owner-only edit and delete controls backed by useRemoveProduct and EditProductModal.",
  "frontend/src/components/ProductGrid.tsx": "Displays a responsive grid of ProductCard components with loading skeletons, an empty state, and an Add Product button (owner-only) that opens the AddProductModal.",
  "frontend/src/components/ProfileHero.tsx": "Renders a hero banner section showing the user's avatar, display name, bio, and social handle with loading skeletons, plus an owner-only Edit Profile button that opens EditProfileModal.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog component that collects and saves a new user's profile information (display name, bio, social handle, photo URL) using a form with validation and a save mutation.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using TanStack Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAuth.ts": "A convenience hook wrapping Internet Identity login/logout logic, exposing authentication state, login/logout handlers, and a helper to get the caller's principal string.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an InternetIdentityProvider and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, persisting and restoring delegated identities across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for all backend interactions including fetching/saving user profiles and CRUD operations on product listings, each tied to the current actor and identity.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS layers, and defines light/dark CSS custom properties for the app's amber-and-charcoal design system.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with TanStack QueryClientProvider and InternetIdentityProvider into the DOM root.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL/hash query parameters, persist them to sessionStorage, retrieve persisted values, and scrub sensitive parameters from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the theme with custom colors (amber, charcoal, sidebar, chart), fonts (Inter, Sora), shadows, border radii, and keyframe animations, using oklch color variables throughout.",
  "project_state.json": "Tracks the current state of the 'Amazon Product Advertiser Profile' project, including implemented features (profile page, product showcase, Internet Identity auth, visual theme, static assets) and pending new feature requests."
}